# Pandas ==> it is an open source library that is used for handle data manipulations

In [1]:
# data structure :
# (1): Series  (2): DataFrame

# (1) Series

In [2]:
import pandas as pd

In [4]:
a=pd.Series([1,23,67,90])
a

0     1
1    23
2    67
3    90
dtype: int64

In [5]:
type(a)

pandas.core.series.Series

# (2) DataFrame

In [6]:
a= {"Emp_id" : [1,2,3,4,5,6,7,8],
   "Name" : ['Rishu','Yashu','Puru','Anuj','Garvankush','Rohit','Lakshit','Vasu'],
   "Department" : ['IT','HR','HR','IT','Operations','IT','Opertions','IT'],
   "working_hrs" : [8,9,7,8,8,7,9,8]}

In [8]:
type(a)

dict

In [10]:
df =pd.DataFrame(a)
df

   Emp_id        Name  Department  working_hrs
0       1       Rishu          IT            8
1       2       Yashu          HR            9
2       3        Puru          HR            7
3       4        Anuj          IT            8
4       5  Garvankush  Operations            8
5       6       Rohit          IT            7
6       7     Lakshit   Opertions            9
7       8        Vasu          IT            8

In [11]:
df.columns

Index(['Emp_id', 'Name', 'Department', 'working_hrs'], dtype='object')

In [13]:
df.head() #it returns top 5 data

   Emp_id        Name  Department  working_hrs
0       1       Rishu          IT            8
1       2       Yashu          HR            9
2       3        Puru          HR            7
3       4        Anuj          IT            8
4       5  Garvankush  Operations            8

In [14]:
df.head(2)

   Emp_id   Name Department  working_hrs
0       1  Rishu         IT            8
1       2  Yashu         HR            9

In [16]:
df.tail() #bottom 5 data

   Emp_id        Name  Department  working_hrs
3       4        Anuj          IT            8
4       5  Garvankush  Operations            8
5       6       Rohit          IT            7
6       7     Lakshit   Opertions            9
7       8        Vasu          IT            8

In [17]:
df.sample(4)    #it return random indexed rows

   Emp_id        Name  Department  working_hrs
1       2       Yashu          HR            9
4       5  Garvankush  Operations            8
5       6       Rohit          IT            7
3       4        Anuj          IT            8

In [19]:
df.describe() #it returns statically view of data

        Emp_id  working_hrs
count  8.00000     8.000000
mean   4.50000     8.000000
std    2.44949     0.755929
min    1.00000     7.000000
25%    2.75000     7.750000
50%    4.50000     8.000000
75%    6.25000     8.250000
max    8.00000     9.000000

In [21]:
df.info()   #complete overview of data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Emp_id       8 non-null      int64
 1   Name         8 non-null      object
 2   Department   8 non-null      object
 3   working_hrs  8 non-null      int64
dtypes: int64(2), object(2)
memory usage: 388.0+ bytes

In [22]:
# if we want ot export our data in csv format

In [23]:
df.to_csv("D:\\Minor_training\\Emp_info.csv")

In [25]:
df.to_csv("D:\\Minor_training\\New_Emp_info.csv" , index=False)

# How to read csv file into jupyter notebook

In [27]:
df = pd.read_csv("D:\\Minor_training\\New_Emp_info.csv")

In [28]:
df.head()

   Emp_id        Name  Department  working_hrs
0       1       Rishu          IT            8
1       2       Yashu          HR            9
2       3        Puru          HR            7
3       4        Anuj          IT            8
4       5  Garvankush  Operations            8

In [29]:
df['Department'].value_counts()

Department
IT            4
HR            2
Operations    1
Opertions     1
Name: count, dtype: int64

In [30]:
a= {"Emp_id" : [1,2,3,4,5,6,7,8],
   "Name" : ['Rishu','Yashu','Puru','Anuj','Garvankush','Rohit','Lakshit','Vasu'],
   "Department" : ['IT','HR','HR','IT','Operations','IT','Opertions','IT'],
   "working_hrs" : [8,9,7,8,8,7,9,8]}

In [31]:
df =pd.DataFrame(a)
df

   Emp_id        Name  Department  working_hrs
0       1       Rishu          IT            8
1       2       Yashu          HR            9
2       3        Puru          HR            7
3       4        Anuj          IT            8
4       5  Garvankush  Operations            8
5       6       Rohit          IT            7
6       7     Lakshit   Opertions            9
7       8        Vasu          IT            8

In [37]:
df['working_hrs'][1]=2

C:\Users\HP\AppData\Local\Temp\ipykernel_16652\3619708038.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['working_hrs'][1]=2

In [38]:
df.head()

   Emp_id        Name  Department  working_hrs
0       1       Rishu          IT            2
1       2       Yashu          HR            2
2       3        Puru          HR            7
3       4        Anuj          IT            8
4       5  Garvankush  Operations            8

In [39]:
#loc & iloc

#df.loc["row_range","column_name"]
#df.iloc["row_range","column_range"]

In [40]:
df.loc[2:5 , ["Name" , "Department"]]

         Name  Department
2        Puru          HR
3        Anuj          IT
4  Garvankush  Operations
5       Rohit          IT

In [43]:
df.iloc[2:5 ,[1,2]]

         Name  Department
2        Puru          HR
3        Anuj          IT
4  Garvankush  Operations

In [44]:
df['Name'][2] = None

C:\Users\HP\AppData\Local\Temp\ipykernel_16652\1090881245.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][2] = None

In [45]:
df['Department'][3] = None
df['Department'][4] = None

C:\Users\HP\AppData\Local\Temp\ipykernel_16652\59155726.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Department'][3] = None
C:\Users\HP\AppData\Local\Temp\ipykernel_16652\59155726.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Department'][4] = None

In [46]:
df

   Emp_id        Name Department  working_hrs
0       1       Rishu         IT            2
1       2       Yashu         HR            2
2       3        None         HR            7
3       4        Anuj       None            8
4       5  Garvankush       None            8
5       6       Rohit         IT            7
6       7     Lakshit  Opertions            9
7       8        Vasu         IT            8

In [47]:
df.isnull() #it will return true if you have missing values otherwise return false

   Emp_id   Name  Department  working_hrs
0   False  False       False        False
1   False  False       False        False
2   False   True       False        False
3   False  False        True        False
4   False  False        True        False
5   False  False       False        False
6   False  False       False        False
7   False  False       False        False

In [48]:
df.isnull().sum()   #we can check total missing values using this method

Emp_id         0
Name           1
Department     2
working_hrs    0
dtype: int64

In [50]:
df=df.dropna()   #remove all the rows of name value
df

   Emp_id     Name Department  working_hrs
0       1    Rishu         IT            2
1       2    Yashu         HR            2
5       6    Rohit         IT            7
6       7  Lakshit  Opertions            9
7       8     Vasu         IT            8